{
  "architectures": [
    "MobileNetV2ForImageClassification"
  ],
  "classifier_dropout_prob": 0.2,
  "depth_divisible_by": 8,
  "depth_multiplier": 1.0,
  "dtype": "float32",
  "expand_ratio": 6,
  "finegrained_output": true,
  "first_layer_is_expansion": true,
  "hidden_act": "relu6",
  "id2label": {
    "0": "1  rice leaf roller",
    "1": "2  rice leaf caterpillar",
    "2": "3  paddy stem maggot",
    "3": "4  asiatic rice borer",
    "4": "5  yellow rice borer",
    "5": "6  rice gall midge",
    "6": "7  Rice Stemfly",
    "7": "8  brown plant hopper",
    "8": "9  white backed plant hopper",
    "9": "10 small brown plant hopper",
    "10": "11 rice water weevil",
    "11": "12 rice leafhopper",
    "12": "13 grain spreader thrips",
    "13": "14 rice shell pest",
    "14": "15 grub",
    "15": "16 mole cricket",
    "16": "17 wireworm",
    "17": "18 white margined moth",
    "18": "19 black cutworm",
    "19": "20 large cutworm",
    "20": "21 yellow cutworm",
    "21": "22 red spider",
    "22": "23 corn borer",
    "23": "24 army worm",
    "24": "25 aphids",
    "25": "26 Potosiabre vitarsis",
    "26": "27 peach borer",
    "27": "28 english grain aphid",
    "28": "29 green bug",
    "29": "30 bird cherry-oataphid",
    "30": "31 wheat blossom midge",
    "31": "32 penthaleus major",
    "32": "33 longlegged spider mite",
    "33": "34 wheat phloeothrips",
    "34": "35 wheat sawfly",
    "35": "36 cerodonta denticornis",
    "36": "37 beet fly",
    "37": "38 flea beetle",
    "38": "39 cabbage army worm",
    "39": "40 beet army worm",
    "40": "41 Beet spot flies",
    "41": "42 meadow moth",
    "42": "43 beet weevil",
    "43": "44 sericaorient alismots chulsky",
    "44": "45 alfalfa weevil",
    "45": "46 flax budworm",
    "46": "47 alfalfa plant bug",
    "47": "48 tarnished plant bug",
    "48": "49 Locustoidea",
    "49": "50 lytta polita",
    "50": "51 legume blister beetle",
    "51": "52 blister beetle",
    "52": "53 therioaphis maculata Buckton",
    "53": "54 odontothrips loti",
    "54": "55 Thrips",
    "55": "56 alfalfa seed chalcid",
    "56": "57 Pieris canidia",
    "57": "58 Apolygus lucorum",
    "58": "59 Limacodidae",
    "59": "60 Viteus vitifoliae",
    "60": "61 Colomerus vitis",
    "61": "62 Brevipoalpus lewisi McGregor",
    "62": "63 oides decempunctata",
    "63": "64 Polyphagotars onemus latus",
    "64": "65 Pseudococcus comstocki Kuwana",
    "65": "66 parathrene regalis",
    "66": "67 Ampelophaga",
    "67": "68 Lycorma delicatula",
    "68": "69  Xylotrechus",
    "69": "70  Cicadella viridis",
    "70": "71  Miridae",
    "71": "72  Trialeurodes vaporariorum",
    "72": "73  Erythroneura apicalis",
    "73": "74  Papilio xuthus",
    "74": "75  Panonchus citri McGregor",
    "75": "76  Phyllocoptes oleiverus ashmead",
    "76": "77  Icerya purchasi Maskell",
    "77": "78  Unaspis yanonensis",
    "78": "79  Ceroplastes rubens",
    "79": "80  Chrysomphalus aonidum",
    "80": "81  Parlatoria zizyphus Lucus",
    "81": "82  Nipaecoccus vastalor",
    "82": "83  Aleurocanthus spiniferus",
    "83": "84  Tetradacus c Bactrocera minax",
    "84": "85  Dacus dorsalis(Hendel)",
    "85": "86  Bactrocera tsuneonis",
    "86": "87  Prodenia litura",
    "87": "88  Adristyrannus",
    "88": "89  Phyllocnistis citrella Stainton",
    "89": "90  Toxoptera citricidus",
    "90": "91  Toxoptera aurantii",
    "91": "92  Aphis citricola Vander Goot",
    "92": "93  Scirtothrips dorsalis Hood",
    "93": "94  Dasineura sp",
    "94": "95  Lawana imitata Melichar",
    "95": "96  Salurnis marginella Guerr",
    "96": "97  Deporaus marginatus Pascoe",
    "97": "98  Chlumetia transversa",
    "98": "99  Mango flat beak leafhopper",
    "99": "100 Rhytidodera bowrinii white",
    "100": "101 Sternochetus frigidus",
    "101": "102 Cicadellidae"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "1  rice leaf roller": 0,
    "10 small brown plant hopper": 9,
    "100 Rhytidodera bowrinii white": 99,
    "101 Sternochetus frigidus": 100,
    "102 Cicadellidae": 101,
    "11 rice water weevil": 10,
    "12 rice leafhopper": 11,
    "13 grain spreader thrips": 12,
    "14 rice shell pest": 13,
    "15 grub": 14,
    "16 mole cricket": 15,
    "17 wireworm": 16,
    "18 white margined moth": 17,
    "19 black cutworm": 18,
    "2  rice leaf caterpillar": 1,
    "20 large cutworm": 19,
    "21 yellow cutworm": 20,
    "22 red spider": 21,
    "23 corn borer": 22,
    "24 army worm": 23,
    "25 aphids": 24,
    "26 Potosiabre vitarsis": 25,
    "27 peach borer": 26,
    "28 english grain aphid": 27,
    "29 green bug": 28,
    "3  paddy stem maggot": 2,
    "30 bird cherry-oataphid": 29,
    "31 wheat blossom midge": 30,
    "32 penthaleus major": 31,
    "33 longlegged spider mite": 32,
    "34 wheat phloeothrips": 33,
    "35 wheat sawfly": 34,
    "36 cerodonta denticornis": 35,
    "37 beet fly": 36,
    "38 flea beetle": 37,
    "39 cabbage army worm": 38,
    "4  asiatic rice borer": 3,
    "40 beet army worm": 39,
    "41 Beet spot flies": 40,
    "42 meadow moth": 41,
    "43 beet weevil": 42,
    "44 sericaorient alismots chulsky": 43,
    "45 alfalfa weevil": 44,
    "46 flax budworm": 45,
    "47 alfalfa plant bug": 46,
    "48 tarnished plant bug": 47,
    "49 Locustoidea": 48,
    "5  yellow rice borer": 4,
    "50 lytta polita": 49,
    "51 legume blister beetle": 50,
    "52 blister beetle": 51,
    "53 therioaphis maculata Buckton": 52,
    "54 odontothrips loti": 53,
    "55 Thrips": 54,
    "56 alfalfa seed chalcid": 55,
    "57 Pieris canidia": 56,
    "58 Apolygus lucorum": 57,
    "59 Limacodidae": 58,
    "6  rice gall midge": 5,
    "60 Viteus vitifoliae": 59,
    "61 Colomerus vitis": 60,
    "62 Brevipoalpus lewisi McGregor": 61,
    "63 oides decempunctata": 62,
    "64 Polyphagotars onemus latus": 63,
    "65 Pseudococcus comstocki Kuwana": 64,
    "66 parathrene regalis": 65,
    "67 Ampelophaga": 66,
    "68 Lycorma delicatula": 67,
    "69  Xylotrechus": 68,
    "7  Rice Stemfly": 6,
    "70  Cicadella viridis": 69,
    "71  Miridae": 70,
    "72  Trialeurodes vaporariorum": 71,
    "73  Erythroneura apicalis": 72,
    "74  Papilio xuthus": 73,
    "75  Panonchus citri McGregor": 74,
    "76  Phyllocoptes oleiverus ashmead": 75,
    "77  Icerya purchasi Maskell": 76,
    "78  Unaspis yanonensis": 77,
    "79  Ceroplastes rubens": 78,
    "8  brown plant hopper": 7,
    "80  Chrysomphalus aonidum": 79,
    "81  Parlatoria zizyphus Lucus": 80,
    "82  Nipaecoccus vastalor": 81,
    "83  Aleurocanthus spiniferus": 82,
    "84  Tetradacus c Bactrocera minax": 83,
    "85  Dacus dorsalis(Hendel)": 84,
    "86  Bactrocera tsuneonis": 85,
    "87  Prodenia litura": 86,
    "88  Adristyrannus": 87,
    "89  Phyllocnistis citrella Stainton": 88,
    "9  white backed plant hopper": 8,
    "90  Toxoptera citricidus": 89,
    "91  Toxoptera aurantii": 90,
    "92  Aphis citricola Vander Goot": 91,
    "93  Scirtothrips dorsalis Hood": 92,
    "94  Dasineura sp": 93,
    "95  Lawana imitata Melichar": 94,
    "96  Salurnis marginella Guerr": 95,
    "97  Deporaus marginatus Pascoe": 96,
    "98  Chlumetia transversa": 97,
    "99  Mango flat beak leafhopper": 98
  },
  "layer_norm_eps": 0.001,
  "min_depth": 8,
  "model_type": "mobilenet_v2",
  "num_channels": 3,
  "output_stride": 32,
  "problem_type": "single_label_classification",
  "semantic_loss_ignore_index": 255,
  "tf_padding": true,
  "transformers_version": "4.57.6"
}
